//=====================================
//
// チュートリアルヘッダー
// Author : Sato Teruto
//
//=====================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_	

//--------------------
// インクルード
//--------------------
#include <d3dx9.h>

//-----------------------
// 前方宣言
//-----------------------
class CBg;	//背景

//-------------------------
// タイトルクラスの定義
//-------------------------
class CTutorial
{
public:
	CTutorial();	//コンストラクタ
	~CTutorial();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

private:
	//------------------
	// 定数
	//------------------
	static const int MaxBg = 3;		//背景の最大数

	//------------------
	// メンバ変数
	//------------------
	bool m_bPressEneter;	//エンターキーが押されたか

	//------------------
	// 静的メンバ変数
	//------------------
	static CBg		 *m_pBG[MaxBg];			//背景クラス
};

#endif