//=====================================
//
// スキルセレクトヘッダー
// Author : Sato Teruto
//
//=====================================
#ifndef _SKILLSELECT_H_
#define _SKILLSELECT_H_	

//--------------------
// インクルード
//--------------------
#include <d3dx9.h>

//-----------------------
// 前方宣言
//-----------------------
class CBg;			//背景

//------------------------------
// スキルセレクトクラスの定義
//------------------------------
class CSkillSelect
{
public:
	CSkillSelect();		//コンストラクタ
	~CSkillSelect();	//デストラクタ

	//------------------
	// メンバ関数
	//------------------
	HRESULT Init();
	void Uninit();
	void Update();

	//------------------
	// 静的メンバ関数
	//------------------
	static CBg	*GetBG();	//背景の取得

private:
	//------------------
	// 静的メンバ変数
	//------------------
	static CBg	*m_pBG;	//背景クラス
};

#endif